## [test-1](https://daniellem97.app.spacelift.io/stack/test-1/run/01J2C02XQQJX2VEG9VT2CSYAJV) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J2AFMJGSRS6Q02NY5TTK4PPJ] Planning changes with 0 custom hooks...
data.terraform_remote_state.demo-stack-state: Reading...
random_string.example: Refreshing state... [id=9Q7h}hL5AT74ZX8(]
data.terraform_remote_state.demo-stack-state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # random_string.example must be replaced
-/+ resource "random_string" "example" {
      ~ id          = "9Q7h}hL5AT74ZX8(" -> (known after apply)
      ~ length      = 16 -> 8 # forces replacement
      ~ result      = "9Q7h}hL5AT74ZX8(" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + dev_ip2       = (sensitive value)
  - random_string = "9Q7h}hL5AT74ZX8(" -> null
  + trigger       = (known after apply)
╷
│ Error: Missing required argument
│ 
│   on providers.tf line 10, in provider "aws":
│   10: provider "aws" {
│ 
│ The argument "region" is required, but no definition was found.
╵
[01J2AFMJGSRS6Q02NY5TTK4PPJ] Unexpected exit code when planning changes: 1
```

</details>